Revit 2027 API
ClosestPointsPairBetweenTwoCurves.Distance Property
 Distance from point on first curve to the point on second curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Distance { get; set; }
Public Property Distance As Double
	Get
	Set
public:
property double Distance {
	double get ();
	void set (double value);
}
member Distance : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  The property has not been set by the method providing the result.
See Also
Reference
ClosestPointsPairBetweenTwoCurves Class
Autodesk.Revit.DB Namespace